 "CreatedDateTime": "2025-07-02T09:32:50.7650495Z",
    "Description": null,
    "DisplayName": "M365 - Block Mobile Email Access (Default)",
    "GrantControls": {
      "AuthenticationStrength": {
        "AllowedCombinations": null,
        "CombinationConfigurations": null,
        "CreatedDateTime": null,
        "Description": null,
        "DisplayName": null,
        "Id": null,
        "ModifiedDateTime": null,
        "PolicyType": null,
        "RequirementsSatisfied": null
      },
      "BuiltInControls": [
        "block"
      ],
      "CustomAuthenticationFactors": [],
      "Operator": "OR",
      "TermsOfUse": []
    },
    "Id": "6b6719da-d302-490c-bedb-3cd0731ba80a",
    "ModifiedDateTime": null,
    "SessionControls": {
      "ApplicationEnforcedRestrictions": {
        "IsEnabled": null
      },
      "CloudAppSecurity": {
        "CloudAppSecurityType": null,
        "IsEnabled": null
      },
      "DisableResilienceDefaults": null,
      "PersistentBrowser": {
        "IsEnabled": null,
        "Mode": null
      },
      "SignInFrequency": {
        "AuthenticationType": null,
        "FrequencyInterval": null,
        "IsEnabled": null,
        "Type": null,
        "Value": null
      }
    },
    "State": "enabledForReportingButNotEnforced",
    "TemplateId": null,
    "AdditionalProperties": {}
  },
  {
    "Conditions": {
      "Applications": {
        "ApplicationFilter": {
          "Mode": null,
          "Rule": null
        },
        "ExcludeApplications": [],
        "IncludeApplications": [
          "Office365"
        ],
        "IncludeAuthenticationContextClassReferences": [],
        "IncludeUserActions": []
      },
      "AuthenticationFlows": {
        "TransferMethods": null
      },
      "ClientAppTypes": [
        "mobileAppsAndDesktopClients"
      ],
      "ClientApplications": {
        "ExcludeServicePrincipals": null,
        "IncludeServicePrincipals": null,
        "ServicePrincipalFilter": {
          "Mode": null,
          "Rule": null
        }
      },
      "Devices": {
        "DeviceFilter": {
          "Mode": null,
          "Rule": null
        }
      },
      "InsiderRiskLevels": null,
      "Locations": {
        "ExcludeLocations": null,
        "IncludeLocations": null
      },
      "Platforms": {
        "ExcludePlatforms": [],
        "IncludePlatforms": [
          "android",
          "iOS"
        ]
      },
      "ServicePrincipalRiskLevels": [],
      "SignInRiskLevels": [],
      "UserRiskLevels": [],
      "Users": {
        "ExcludeGroups": [],
        "ExcludeGuestsOrExternalUsers": {
          "ExternalTenants": {
            "MembershipKind": null
          },
          "GuestOrExternalUserTypes": null
        },
        "ExcludeRoles": [],
        "ExcludeUsers": [],
        "IncludeGroups": [
          "4e212d0a-ec09-4f97-b213-a019a81a5b3a"
        ],
        "IncludeGuestsOrExternalUsers": {
          "ExternalTenants": {
            "MembershipKind": null
          },
          "GuestOrExternalUserTypes": null
        },
        "IncludeRoles": [],
        "IncludeUsers": []
      }
    },
